Walmart sales Analysis Q2

In [47]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [49]:
df = pd.read_excel(r"C:\Users\cheth\Downloads\Walmart_Sales_CB1799BACC_77EAC63B5D.xlsx")

In [50]:
df.shape

(1000, 12)

In [53]:
df.columns

Index(['Invoice ID', 'Branch', 'City', 'Customer type', 'Gender',
       'Product line', 'Unit price', 'Quantity', 'Date', 'Time', 'Payment',
       'Rating'],
      dtype='object')

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice ID     1000 non-null   object
 1   Branch         1000 non-null   object
 2   City           1000 non-null   object
 3   Customer type  1000 non-null   object
 4   Gender         1000 non-null   object
 5   Product line   1000 non-null   object
 6   Unit price     1000 non-null   float64
 7   Quantity       1000 non-null   int64
 8   Date           1000 non-null   object
 9   Time           1000 non-null   object
 10  Payment        1000 non-null   object
 11  Rating         1000 non-null   float64
dtypes: float64(2), int64(1), object(9)
memory usage: 93.9+ KB

In [57]:
 df.describe()

        Unit price     Quantity      Rating
count  1000.000000  1000.000000  1000.00000
mean     55.672130     5.510000     6.97270
std      26.494628     2.923431     1.71858
min      10.080000     1.000000     4.00000
25%      32.875000     3.000000     5.50000
50%      55.230000     5.000000     7.00000
75%      77.935000     8.000000     8.50000
max      99.960000    10.000000    10.00000

In [59]:
df.Date = pd.to_datetime(df.Date)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice ID     1000 non-null   object
 1   Branch         1000 non-null   object
 2   City           1000 non-null   object
 3   Customer type  1000 non-null   object
 4   Gender         1000 non-null   object
 5   Product line   1000 non-null   object
 6   Unit price     1000 non-null   float64
 7   Quantity       1000 non-null   int64
 8   Date           1000 non-null   datetime64[ns]
 9   Time           1000 non-null   object
 10  Payment        1000 non-null   object
 11  Rating         1000 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(8)
memory usage: 93.9+ KB

In [63]:
df['Revenue']=df['Quantity']*df['Unit price']

In [65]:
df.head(5)

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Date,Time,Payment,Rating,Revenue
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,2019-01-05,13:08:00,Ewallet,9.1,522.83
1,226-31-3081,A,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,2019-03-08,10:29:00,Cash,9.6,76.40
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,2019-03-03,13:23:00,Credit card,7.4,324.31
3,123-19-1176,B,Yangon,Member,Male,Health and beauty,58.22,8,2019-01-27,20:33:00,Ewallet,8.4,465.76
4,373-73-7910,C,Yangon,Normal,Male,Sports and travel,86.31,7,2019-02-08,10:37:00,Ewallet,5.3,604.17

In [67]:
city = 'Naypyitaw'
city_info = df[df['City'] == city]

average_price = city_info.groupby('Branch')['Unit price'].mean().reset_index()

average_price.columns = ['Branch', 'Average Price']

for index, row in average_price.iterrows():
    print('Naypyitaw 'f"Branch: {row['Branch']}, Average Price: {row['Average Price']:.2f}")

Naypyitaw Branch: A, Average Price: 54.12
Naypyitaw Branch: B, Average Price: 57.79
Naypyitaw Branch: C, Average Price: 57.94

In [69]:
city = 'Yangon'
city_info = df[df['City'] == city]

average_price = city_info.groupby('Branch')['Unit price'].mean().reset_index()

average_price.columns = ['Branch', 'Average Price']

for index, row in average_price.iterrows():
    print('Yangon 'f"Branch: {row['Branch']}, Average Price: {row['Average Price']:.2f}")

Yangon Branch: A, Average Price: 55.64
Yangon Branch: B, Average Price: 56.01
Yangon Branch: C, Average Price: 52.68

In [71]:
city = 'Mandalay'
city_info = df[df['City'] == city]

average_price = city_info.groupby('Branch')['Unit price'].mean().reset_index()

average_price.columns = ['Branch', 'Average Price']

for index, row in average_price.iterrows():
    print('Mandalay 'f"Branch: {row['Branch']}, Average Price: {row['Average Price']:.2f}")

Mandalay Branch: A, Average Price: 53.35
Mandalay Branch: B, Average Price: 56.13
Mandalay Branch: C, Average Price: 57.96